Workspace/OpenFOAM-v1812-AD/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/hotRoom/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
\cp 0/T.orig 0/T
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
